tests/resources/directpayment/doRecurrentWalletPayment/doRecurrentWalletPaymentRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://impl.ws.payline.experian.com" xmlns:ns2="http://obj.ws.payline.experian.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Body>
        <ns1:doRecurrentWalletPaymentRequest>
            <ns1:version>90</ns1:version>
            <ns1:payment>
                <ns2:amount>1000</ns2:amount>
                <ns2:currency>978</ns2:currency>
                <ns2:action>100</ns2:action>
                <ns2:mode>CPT</ns2:mode>
                <ns2:contractNumber>CB</ns2:contractNumber>
                <ns2:differedActionDate>DiffActDate 11/11/2011</ns2:differedActionDate>
                <ns2:method>Method</ns2:method>
                <ns2:softDescriptor xsi:nil="true"/>
                <ns2:cardBrand>VISA</ns2:cardBrand>
                <ns2:registrationToken xsi:nil="true"/>
                <ns2:cumulatedAmount xsi:nil="true"/>
            </ns1:payment>
            <ns1:orderRef>OrderRefbbbb</ns1:orderRef>
            <ns1:orderDate>15/01/2020 10:00</ns1:orderDate>
            <ns1:scheduledDate>15/01/1990</ns1:scheduledDate>
            <ns1:walletId>walletIdzzzz</ns1:walletId>
            <ns1:cardInd>2</ns1:cardInd>
            <ns1:cvx>123</ns1:cvx>
            <ns1:recurring>
                <ns2:firstAmount>30</ns2:firstAmount>
                <ns2:amount>100</ns2:amount>
                <ns2:billingCycle>12</ns2:billingCycle>
                <ns2:billingLeft>20</ns2:billingLeft>
                <ns2:billingDay>5</ns2:billingDay>
                <ns2:startDate>01/01/2020 10:00</ns2:startDate>
                <ns2:endDate>01/01/2122 10:00</ns2:endDate>
                <ns2:newAmount>40000</ns2:newAmount>
                <ns2:amountModificationDate>02/01/2020 10:00</ns2:amountModificationDate>
                <ns2:billingRank>12</ns2:billingRank>
            </ns1:recurring>
            <ns1:privateDataList/>
            <ns1:order>
                <ns2:ref>myOrderRef_35656</ns2:ref>
                <ns2:origin>BIGBANG</ns2:origin>
                <ns2:country>FRANCE</ns2:country>
                <ns2:taxes>50%</ns2:taxes>
                <ns2:amount>1000</ns2:amount>
                <ns2:currency>978</ns2:currency>
                <ns2:date>15/12/2014 12:20</ns2:date>
                <ns2:details/>
                <ns2:deliveryTime>entre 6h et 22h</ns2:deliveryTime>
                <ns2:deliveryMode>Par camion</ns2:deliveryMode>
                <ns2:deliveryExpectedDate>Demain</ns2:deliveryExpectedDate>
                <ns2:deliveryExpectedDelay>200</ns2:deliveryExpectedDelay>
                <ns2:deliveryCharge>DeliveryChareg 8</ns2:deliveryCharge>
                <ns2:discountAmount xsi:nil="true"/>
                <ns2:otaPackageType xsi:nil="true"/>
                <ns2:otaDestinationCountry xsi:nil="true"/>
                <ns2:bookingReference>BookingRef ppp</ns2:bookingReference>
                <ns2:orderDetail>OrderDetails 9999</ns2:orderDetail>
                <ns2:orderExtended xsi:nil="true"/>
                <ns2:orderOTA>OrderOTA supp</ns2:orderOTA>
            </ns1:order>
            <ns1:media>media pc</ns1:media>
            <ns1:authentication3DSecure>
                <ns2:md>Md2123454657897</ns2:md>
                <ns2:pares>pares</ns2:pares>
                <ns2:xid>xidzzzzz</ns2:xid>
                <ns2:eci>05</ns2:eci>
                <ns2:cavv>aaaaaaaaaaaaaaa</ns2:cavv>
                <ns2:cavvAlgorithm>cavvAlgorithm2222</ns2:cavvAlgorithm>
                <ns2:vadsResult>vadsResult3333</ns2:vadsResult>
                <ns2:typeSecurisation>very secure</ns2:typeSecurisation>
                <ns2:PaResStatus>ParesStatus9</ns2:PaResStatus>
                <ns2:VeResStatus>VeResStatus8</ns2:VeResStatus>
                <ns2:resultContainer>resultContainer xxxxxxxxxxxx</ns2:resultContainer>
                <ns2:authenticationResult>Failed</ns2:authenticationResult>
            </ns1:authentication3DSecure>
            <ns1:linkedTransactionId>LinkedTrsIdyyyy</ns1:linkedTransactionId>
        </ns1:doRecurrentWalletPaymentRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>